---
kind: enumMember
id: F:Autodesk.Revit.UI.PostableCommand.ElectricalAnalyticalLoadTypeSettings
enum: Autodesk.Revit.UI.PostableCommand
source: html/f6ccdc1b-6ac3-9c49-d0bb-8a7d1877eab0.htm
---
# Autodesk.Revit.UI.PostableCommand.ElectricalAnalyticalLoadTypeSettings

Opens the Electrical Analytical Load Type Settings dialog to define the power requirement for area-based loads.